docs: add d2 diagrams
